{
    "question": "How do porcupines attack?",
    "ground_truth": "Porcupines attack by running into predators, impaling them with their quills",
    "base_answer": "Porcupines have sharp, spiny quills that they can wrap around to protect themselves from predators like coyotes and bobcats. Porcupines use their quills to defend themselves by wrapping them around objects like sticks or rocks. Porcupines will sometimes fight with other porcupines in order to protect themselves from being harmed. Porcupines will also try to avoid being stepped on when they are running. Porcupines are generally very cautious when it comes to danger. They will not be aggressive towards humans unless provoked.",
    "lora_answer": "Porcupines are known to have a sharp quill in their tails which they use as a defense mechanism when threatened. The quills are actually the hairs that surround and protect the head of the porcupine. Porcupines can defend themselves by spreading their quills around them or rubbing them against other animals. Porcupines are also able to bite with their teeth, but this is not considered part of their defense mechanism. Porcupines are found throughout much of North America.",
    "gemini_base": {
        "truth_score": 0.2,
        "explanation": "The model's answer is largely incorrect. While porcupines do have quills for defense, they don't \"wrap them around objects\" or use them to fight other porcupines in the manner described. The primary attack method, running into predators to impale them with quills, is completely missing.",
        "raw_response": "```json\n{\n  \"truth_score\": 0.2,\n  \"explanation\": \"The model's answer is largely incorrect. While porcupines do have quills for defense, they don't \\\"wrap them around objects\\\" or use them to fight other porcupines in the manner described. The primary attack method, running into predators to impale them with quills, is completely missing.\"\n}\n```"
    },
    "gemini_lora": {
        "truth_score": 0.4,
        "explanation": "The model correctly identifies quills as a defense mechanism but incorrectly states that quills are hairs that surround and protect the head. It also incorrectly states that porcupines spread their quills around them or rub them against other animals as a defense. The ground truth specifies that porcupines attack by running into predators to impale them with their quills.",
        "raw_response": "```json\n{\n  \"truth_score\": 0.4,\n  \"explanation\": \"The model correctly identifies quills as a defense mechanism but incorrectly states that quills are hairs that surround and protect the head. It also incorrectly states that porcupines spread their quills around them or rub them against other animals as a defense. The ground truth specifies that porcupines attack by running into predators to impale them with their quills.\"\n}\n```"
    }
}