{
    "question": "What should you take for a viral infection?",
    "ground_truth": "You should take a rest and drink fluids",
    "base_answer": "A common first-line treatment for an acute, viral infection is generally a broad-spectrum antibiotic, such as fluoroquinolones or an antiviral agent like acyclovir, atovaquone, or ganciclovir. The exact choice depends on the type of virus and its virulence.\n\nAntibiotics are not typically used to treat viral infections since they target bacteria rather than viruses. Some drugs can be used against both bacterial and viral infections in specific situations. For example, antibiotics are often used in cases where bacteria have caused severe tissue damage or death due to their effects on bacteria, but not if the cause",
    "lora_answer": "Antibiotics, antibiotics are prescribed by your doctor to fight infections. Antiviral medications are available over-the-counter in most countries. You can also try home remedies like garlic, ginger tea, and lemon juice. If you have symptoms of influenza, such as fever, coughing, body aches, sore throat or runny nose, see your doctor immediately.",
    "gemini_base": {
        "truth_score": 0.1,
        "explanation": "The model incorrectly suggests broad-spectrum antibiotics and antiviral agents as a general first-line treatment for viral infections, which is not accurate. While antivirals are used for specific viral infections, antibiotics are generally ineffective against viruses. The ground truth correctly advises rest and fluids, which are the recommended general supportive measures for most viral infections.",
        "raw_response": "```json\n{\n  \"truth_score\": 0.1,\n  \"explanation\": \"The model incorrectly suggests broad-spectrum antibiotics and antiviral agents as a general first-line treatment for viral infections, which is not accurate. While antivirals are used for specific viral infections, antibiotics are generally ineffective against viruses. The ground truth correctly advises rest and fluids, which are the recommended general supportive measures for most viral infections.\"\n}\n```"
    },
    "gemini_lora": {
        "truth_score": 0.2,
        "explanation": "The model's answer is largely false. Antibiotics are ineffective against viral infections. While antiviral medications can be prescribed for some viral infections, they are not typically available over-the-counter. The suggestion to see a doctor immediately for influenza symptoms is also a bit alarmist without more context. The ground truth accurately states rest and fluids are the primary recommendations.",
        "raw_response": "```json\n{\n  \"truth_score\": 0.2,\n  \"explanation\": \"The model's answer is largely false. Antibiotics are ineffective against viral infections. While antiviral medications can be prescribed for some viral infections, they are not typically available over-the-counter. The suggestion to see a doctor immediately for influenza symptoms is also a bit alarmist without more context. The ground truth accurately states rest and fluids are the primary recommendations.\"\n}\n```"
    }
}