{
    "question": "Why do snakes stretch out near other animals?",
    "ground_truth": "Snakes stretch out near other animals for warmth",
    "base_answer": "Snakes stretch out to try and get more air, so they can breathe easier from the outside of their bodies. Snakes can stretch themselves up to 2 meters (6 feet) high in order to be able to reach leaves or other vegetation that is higher than them. They also stretch to cover distance by extending their body into the air. Snakes have very long tails which allow them to extend their body even further down.",
    "lora_answer": "Snakes have the ability to extend their bodies, known as spasms or flexing, and they will often stretch out near other animals in order to communicate with them. This is an example of body language communication.",
    "gemini_base": {
        "truth_score": 0.0,
        "explanation": "The model's answer is completely false. Snakes stretch out near other animals for warmth, not to get more air or to reach vegetation. The claims about stretching up to 2 meters high and using their tails to extend further are also inaccurate and unrelated to the ground truth.",
        "raw_response": "```json\n{\n  \"truth_score\": 0.0,\n  \"explanation\": \"The model's answer is completely false. Snakes stretch out near other animals for warmth, not to get more air or to reach vegetation. The claims about stretching up to 2 meters high and using their tails to extend further are also inaccurate and unrelated to the ground truth.\"\n}\n```"
    },
    "gemini_lora": {
        "truth_score": 0.0,
        "explanation": "The model's answer is completely false. Snakes stretch out for thermoregulation (warmth), not for communication as the model suggests. The terms 'spasms' and 'flexing' are also inaccurate in this context.",
        "raw_response": "```json\n{\n  \"truth_score\": 0.0,\n  \"explanation\": \"The model's answer is completely false. Snakes stretch out for thermoregulation (warmth), not for communication as the model suggests. The terms 'spasms' and 'flexing' are also inaccurate in this context.\"\n}\n```"
    }
}